app/controllers/ereports_controller.rb

SELECT "stocks".* FROM "stocks" WHERE "stocks"."symbol" = ?  [["symbol", "TSLA"]]
SELECT COUNT(*) FROM "stocks" WHERE "stocks"."symbol" = ?  [["symbol", "TSLA"]]
INSERT INTO "stocks" ("symbol", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["symbol", "AAPL"], ["created_at", "2015-05-06 00:45:16.349547"], ["updated_at", "2015-05-06 00:45:16.349547"]]
INSERT INTO "ereports" ("symbol", "date", "stock_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["symbol", "AAPL"], ["date", "2012-01-24"], ["stock_id", 1], ["created_at", "2015-05-06 00:45:17.897125"], ["updated_at", "2015-05-06 00:45:17.897125"]]
SELECT  "ereports".* FROM "ereports" WHERE "ereports"."stock_id" = ?  ORDER BY "ereports"."id" ASC LIMIT 1  [["stock_id", 17]]
---
	def create
		require 'open-uri'
		search_result = Stock.where(symbol:params[:symbol])

		if search_result.empty?
			@stock = Stock.new(symbol:params[:symbol])
			@stock.save
			p "stock stored in db, where stock_id = #{@stock.id}"
			qrt = [1,2,3,4]
			year = [2012, 2013, 2014, 2015]
			year.each do |each_year|
				qrt.each do |each_qrt|
					url = "http://www.estimize.com/#{params[:symbol]}/fq#{each_qrt}-#{each_year}#chart=historical"
					begin
						page = Nokogiri::HTML(open(url))
					rescue
						p "no reports for #{each_year} #{each_qrt}"
					else
						page.search('.date').map do |element|
							temp = (element.inner_text[0..-5]).split('/')
							date_str = (temp[1] +'/'+ temp[0] +'/20'+ temp[2]).to_s
							earning_report = Ereport.create(symbol:params[:symbol], date:date_str, stock_id:@stock.id)
							p earning_report.stock_id
						end
					end
				end
			end
			@all_ers = search_result[0].ereports
			begin
			@stock = @all_ers.first.symbol

INSERT INTO "price_before_ers" ("ereport_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["ereport_id", 1], ["created_at", "2015-05-06 00:45:40.960880"], ["updated_at", "2015-05-06 00:45:40.960880"]]
INSERT INTO "price_on_ers" ("ereport_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["ereport_id", 1], ["created_at", "2015-05-06 00:45:40.981793"], ["updated_at", "2015-05-06 00:45:40.981793"]]
INSERT INTO "price_after_ers" ("ereport_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["ereport_id", 1], ["created_at", "2015-05-06 00:45:41.003937"], ["updated_at", "2015-05-06 00:45:41.003937"]]
---
					page.search('.yfnc_datamodoutline1').map do |element|
						# @html.push(element.inner_html)
						pricing_array = []
						price_before_er = PriceBeforeEr.create(ereport_id:earning.id)
						price_on_er = PriceOnEr.create(ereport_id:earning.id)
						price_after_er = PriceAfterEr.create(ereport_id:earning.id)

UPDATE "price_before_ers" SET "price_date" = ?, "updated_at" = ? WHERE "price_before_ers"."id" = ?  [["price_date", "2012-05-08"], ["updated_at", "2015-05-05 19:27:41.799708"], ["id", 12]]
UPDATE "price_after_ers" SET "price_date" = ?, "updated_at" = ? WHERE "price_after_ers"."id" = ?  [["price_date", "2012-05-10"], ["updated_at", "2015-05-05 19:10:32.114646"], ["id", 2]]
UPDATE "price_on_ers" SET "price_date" = ?, "updated_at" = ? WHERE "price_on_ers"."id" = ?  [["price_date", "2012-05-09"], ["updated_at", "2015-05-05 19:27:41.776368"], ["id", 12]]
---
								er_date = Date.parse(html_str)
								if er_date < the_day
									price_before_er.price_date = er_date
									price_before_er.save
								elsif er_date > the_day
									price_after_er.price_date = er_date
									price_after_er.save
								else
									price_on_er.price_date = er_date
									price_on_er.save

SELECT COUNT(*) FROM "ereports" WHERE "ereports"."stock_id" = ?  [["stock_id", 17]]
---
			@stock_info = Stock.where(symbol:params[:symbol])[0]
			@all_reports = @stock_info.ereports
			@no_report = false
			if @all_reports.count == 0