app/controllers/stocks_controller.rb

SELECT "stocks".* FROM "stocks" WHERE "stocks"."symbol" = $1  [["symbol", "BABA"]]
SELECT "ereports".* FROM "ereports" WHERE "ereports"."stock_id" = $1  [["stock_id", 5]]
---
	def create
		stock_symbol = params[:symbol].upcase
		stock = Stock.where(symbol:stock_symbol)[0]
 		@all_ers = stock.ereports
 		@all_ers.each do |earning|

SELECT "stocks".* FROM "stocks" WHERE "stocks"."symbol" = $1  [["symbol", "BABA"]]
SELECT "ereports".* FROM "ereports" WHERE "ereports"."stock_id" = $1  [["stock_id", 5]]
---
  def show
  	require 'yahoo_stock'
  	stock_symbol = params[:symbol].upcase
		stock = Stock.find_by(symbol:stock_symbol)
		@stock_id = stock.id
		@stock = stock.symbol
		@all_ers = stock.ereports.order('date DESC')
		p @all_ers.first